<a href="https://colab.research.google.com/github/mradulpandya/Data_Analysis/blob/main/CleaningData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
pwd

'/content'

In [ ]:
!mkdir my_assignment

mkdir: cannot create directory ‘my_assignment’: File exists

In [14]:
cd my_assignment

/content/my_assignment

In [16]:
from google.colab import files
upload = files.upload()

Saving test.csv to test.csv
Saving train.csv to train.csv

# Importing Libraries

In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb

# Loading test dataset

In [19]:
#Reading test csv data file
test_df = pd.read_csv("test.csv")

#List all the number of columns
test_df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [26]:
#number of items in the dataset
len(test_df)

233599

In [25]:
#shape of the dataset
print(test_df.shape)

(233599, 11)

In [20]:
#List Top 5 row in data set
test_df.head()

   User_ID Product_ID  ... Product_Category_2 Product_Category_3
0  1000004  P00128942  ...               11.0                NaN
1  1000009  P00113442  ...                5.0                NaN
2  1000010  P00288442  ...               14.0                NaN
3  1000010  P00145342  ...                9.0                NaN
4  1000011  P00053842  ...                5.0               12.0

[5 rows x 11 columns]

In [21]:
#List Bottom 5 row in data set
test_df.tail()

        User_ID Product_ID  ... Product_Category_2 Product_Category_3
233594  1006036  P00118942  ...                NaN                NaN
233595  1006036  P00254642  ...                8.0                NaN
233596  1006036  P00031842  ...                5.0               12.0
233597  1006037  P00124742  ...               16.0                NaN
233598  1006039  P00316642  ...                5.0                NaN

[5 rows x 11 columns]

In [22]:
test_df.head(10)

   User_ID Product_ID  ... Product_Category_2 Product_Category_3
0  1000004  P00128942  ...               11.0                NaN
1  1000009  P00113442  ...                5.0                NaN
2  1000010  P00288442  ...               14.0                NaN
3  1000010  P00145342  ...                9.0                NaN
4  1000011  P00053842  ...                5.0               12.0
5  1000013  P00350442  ...                3.0               15.0
6  1000013  P00155442  ...               11.0               15.0
7  1000013   P0094542  ...                4.0                9.0
8  1000015  P00161842  ...               13.0               16.0
9  1000022  P00067942  ...               14.0                NaN

[10 rows x 11 columns]

In [23]:
#Describe function used to final various values like mean, standrd deviation, max, min etc
test_df.describe()

            User_ID     Occupation  ...  Product_Category_2  Product_Category_3
count  2.335990e+05  233599.000000  ...       161255.000000        71037.000000
mean   1.003029e+06       8.085407  ...            9.849586           12.669454
std    1.726505e+03       6.521146  ...            5.094943            4.125944
min    1.000001e+06       0.000000  ...            2.000000            3.000000
25%    1.001527e+06       2.000000  ...            5.000000            9.000000
50%    1.003070e+06       7.000000  ...            9.000000           14.000000
75%    1.004477e+06      14.000000  ...           15.000000           16.000000
max    1.006040e+06      20.000000  ...           18.000000           18.000000

[8 rows x 6 columns]

In [24]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     233599 non-null  int64
 1   Product_ID                  233599 non-null  object
 2   Gender                      233599 non-null  object
 3   Age                         233599 non-null  object
 4   Occupation                  233599 non-null  int64
 5   City_Category               233599 non-null  object
 6   Stay_In_Current_City_Years  233599 non-null  object
 7   Marital_Status              233599 non-null  int64
 8   Product_Category_1          233599 non-null  int64
 9   Product_Category_2          161255 non-null  float64
 10  Product_Category_3          71037 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

# Loading train dataset

In [28]:
#Reading train csv data file
train_df = pd.read_csv("train.csv")

#List all the number of columns
train_df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [29]:
#number of items in the dataset
len(train_df)

550068

In [30]:
#shape of the dataset
print(train_df.shape)

(550068, 12)

In [31]:
#List Top 5 row in data set
train_df.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [32]:
#List Bottom 5 row in data set
train_df.tail()

        User_ID Product_ID  ... Product_Category_3 Purchase
550063  1006033  P00372445  ...                NaN      368
550064  1006035  P00375436  ...                NaN      371
550065  1006036  P00375436  ...                NaN      137
550066  1006038  P00375436  ...                NaN      365
550067  1006039  P00371644  ...                NaN      490

[5 rows x 12 columns]

In [33]:
#Describe function used to final various values like mean, standrd deviation, max, min etc
train_df.describe()

            User_ID     Occupation  ...  Product_Category_3       Purchase
count  5.500680e+05  550068.000000  ...       166821.000000  550068.000000
mean   1.003029e+06       8.076707  ...           12.668243    9263.968713
std    1.727592e+03       6.522660  ...            4.125338    5023.065394
min    1.000001e+06       0.000000  ...            3.000000      12.000000
25%    1.001516e+06       2.000000  ...            9.000000    5823.000000
50%    1.003077e+06       7.000000  ...           14.000000    8047.000000
75%    1.004478e+06      14.000000  ...           16.000000   12054.000000
max    1.006040e+06      20.000000  ...           18.000000   23961.000000

[8 rows x 7 columns]

In [34]:
#Give information about a DataFrame including the index dtype and columns, non-null values and memory usage
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     233599 non-null  int64
 1   Product_ID                  233599 non-null  object
 2   Gender                      233599 non-null  object
 3   Age                         233599 non-null  object
 4   Occupation                  233599 non-null  int64
 5   City_Category               233599 non-null  object
 6   Stay_In_Current_City_Years  233599 non-null  object
 7   Marital_Status              233599 non-null  int64
 8   Product_Category_1          233599 non-null  int64
 9   Product_Category_2          161255 non-null  float64
 10  Product_Category_3          71037 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

#Merging Dataset

In [35]:
New_df = test_df.append(train_df)

In [37]:
#List all the number of columns
New_df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [38]:
#number of items in the dataset
len(New_df)

783667

In [39]:
#shape of the dataset
print(New_df.shape)

(783667, 12)

In [40]:
#List Top 5 row in data set
New_df.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000004  P00128942      M  ...               11.0                 NaN      NaN
1  1000009  P00113442      M  ...                5.0                 NaN      NaN
2  1000010  P00288442      F  ...               14.0                 NaN      NaN
3  1000010  P00145342      F  ...                9.0                 NaN      NaN
4  1000011  P00053842      F  ...                5.0                12.0      NaN

[5 rows x 12 columns]

In [41]:
#List Bottom 5 row in data set
New_df.tail()

        User_ID Product_ID  ... Product_Category_3 Purchase
550063  1006033  P00372445  ...                NaN    368.0
550064  1006035  P00375436  ...                NaN    371.0
550065  1006036  P00375436  ...                NaN    137.0
550066  1006038  P00375436  ...                NaN    365.0
550067  1006039  P00371644  ...                NaN    490.0

[5 rows x 12 columns]

In [42]:
#Describe function used to final various values like mean, standrd deviation, max, min etc
New_df.describe()

            User_ID     Occupation  ...  Product_Category_3       Purchase
count  7.836670e+05  783667.000000  ...       237858.000000  550068.000000
mean   1.003029e+06       8.079300  ...           12.668605    9263.968713
std    1.727267e+03       6.522206  ...            4.125510    5023.065394
min    1.000001e+06       0.000000  ...            3.000000      12.000000
25%    1.001519e+06       2.000000  ...            9.000000    5823.000000
50%    1.003075e+06       7.000000  ...           14.000000    8047.000000
75%    1.004478e+06      14.000000  ...           16.000000   12054.000000
max    1.006040e+06      20.000000  ...           18.000000   23961.000000

[8 rows x 7 columns]

In [43]:
#Give information about a DataFrame including the index dtype and columns, non-null values and memory usage
New_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     783667 non-null  int64
 1   Product_ID                  783667 non-null  object
 2   Gender                      783667 non-null  object
 3   Age                         783667 non-null  object
 4   Occupation                  783667 non-null  int64
 5   City_Category               783667 non-null  object
 6   Stay_In_Current_City_Years  783667 non-null  object
 7   Marital_Status              783667 non-null  int64
 8   Product_Category_1          783667 non-null  int64
 9   Product_Category_2          537685 non-null  float64
 10  Product_Category_3          237858 non-null  float64
 11  Purchase                    550068 non-null  float64
dtypes: float64(3), int64(4), object(5)
memory usage: 77.7+ MB